LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263S/aw882xx_pid_2032_reg.h
#ifndef __AW_PID_2032_REG_H__
#define __AW_PID_2032_REG_H__

/* registers list */
#define AW_PID_2032_ID_REG				(0x00)
#define AW_PID_2032_SYSST_REG			(0x01)
#define AW_PID_2032_SYSINT_REG			(0x02)
#define AW_PID_2032_SYSINTM_REG			(0x03)
#define AW_PID_2032_SYSCTRL_REG			(0x04)
#define AW_PID_2032_SYSCTRL2_REG		(0x05)
#define AW_PID_2032_I2SCTRL_REG			(0x06)
#define AW_PID_2032_I2SCFG1_REG			(0x07)
#define AW_PID_2032_I2SCFG2_REG			(0x08)
#define AW_PID_2032_HAGCCFG1_REG		(0x09)
#define AW_PID_2032_HAGCCFG2_REG		(0x0A)
#define AW_PID_2032_HAGCCFG3_REG		(0x0B)
#define AW_PID_2032_HAGCCFG4_REG		(0x0C)
#define AW_PID_2032_HAGCCFG5_REG		(0x0D)
#define AW_PID_2032_HAGCCFG6_REG		(0x0E)
#define AW_PID_2032_HAGCCFG7_REG		(0x0F)
#define AW_PID_2032_HAGCST_REG			(0x10)
#define AW_PID_2032_PRODID_REG			(0x11)
#define AW_PID_2032_VBAT_REG			(0x12)
#define AW_PID_2032_TEMP_REG			(0x13)
#define AW_PID_2032_PVDD_REG			(0x14)
#define AW_PID_2032_HAGCCFG8_REG		(0x15)
#define AW_PID_2032_DBGCTRL_REG			(0x20)
#define AW_PID_2032_I2SINT_REG			(0x21)
#define AW_PID_2032_I2SCAPCNT_REG		(0x22)
#define AW_PID_2032_ANASTA1_REG			(0x23)
#define AW_PID_2032_ANASTA2_REG			(0x24)
#define AW_PID_2032_ANASTA3_REG			(0x25)
#define AW_PID_2032_ANASTA4_REG			(0x26)
#define AW_PID_2032_DSMCFG1_REG			(0x30)
#define AW_PID_2032_DSMCFG2_REG			(0x31)
#define AW_PID_2032_DSMCFG3_REG			(0x32)
#define AW_PID_2032_DSMCFG4_REG			(0x33)
#define AW_PID_2032_DSMCFG5_REG			(0x34)
#define AW_PID_2032_DSMCFG6_REG			(0x35)
#define AW_PID_2032_DSMCFG7_REG			(0x36)
#define AW_PID_2032_DSMCFG8_REG			(0x37)
#define AW_PID_2032_TESTIN_REG			(0x38)
#define AW_PID_2032_TESTOUT_REG			(0x39)
#define AW_PID_2032_VSNCTRL1_REG		(0x50)
#define AW_PID_2032_ISNCTRL1_REG		(0x52)
#define AW_PID_2032_ISNCTRL2_REG		(0x53)
#define AW_PID_2032_VTMCTRL1_REG		(0x54)
#define AW_PID_2032_VTMCTRL2_REG		(0x55)
#define AW_PID_2032_VTMCTRL3_REG		(0x56)
#define AW_PID_2032_ISNDAT_REG			(0x57)
#define AW_PID_2032_VSNDAT_REG			(0x58)
#define AW_PID_2032_PWMCTRL_REG			(0x59)
#define AW_PID_2032_PWMCTRL2_REG		(0x5A)
#define AW_PID_2032_BSTCTRL1_REG		(0x60)
#define AW_PID_2032_BSTCTRL2_REG		(0x61)
#define AW_PID_2032_BSTCTRL3_REG		(0x62)
#define AW_PID_2032_BSTDBG1_REG			(0x63)
#define AW_PID_2032_BSTDBG2_REG			(0x64)
#define AW_PID_2032_BSTDBG3_REG			(0x65)
#define AW_PID_2032_PLLCTRL1_REG		(0x66)
#define AW_PID_2032_PLLCTRL2_REG		(0x67)
#define AW_PID_2032_PLLCTRL3_REG		(0x68)
#define AW_PID_2032_CDACTRL1_REG		(0x69)
#define AW_PID_2032_CDACTRL2_REG		(0x6A)
#define AW_PID_2032_SADCCTRL_REG		(0x6B)
#define AW_PID_2032_BSTCTRL8_REG		(0x6C)
#define AW_PID_2032_TESTCTRL1_REG		(0x70)
#define AW_PID_2032_TESTCTRL2_REG		(0x71)
#define AW_PID_2032_EFCTRL1_REG			(0x72)
#define AW_PID_2032_EFCTRL2_REG			(0x73)
#define AW_PID_2032_EFWH_REG			(0x74)
#define AW_PID_2032_EFWM2_REG			(0x75)
#define AW_PID_2032_EFWM1_REG			(0x76)
#define AW_PID_2032_EFWL_REG			(0x77)
#define AW_PID_2032_EFRH_REG			(0x78)
#define AW_PID_2032_EFRM2_REG			(0x79)
#define AW_PID_2032_EFRM1_REG			(0x7A)
#define AW_PID_2032_EFRL_REG			(0x7B)
#define AW_PID_2032_TESTDET_REG			(0x7C)
#define AW_PID_2032_TM_REG				(0x7D)

/********************************************
 * Register Access
 *******************************************/
#define AW_PID_2032_REG_MAX				(0x7E)

#define AW_PID_2032_REG_NONE_ACCESS					(0)
#define AW_PID_2032_REG_RD_ACCESS					(1 << 0)
#define AW_PID_2032_REG_WR_ACCESS					(1 << 1)

const unsigned char aw_pid_2032_reg_access[AW_PID_2032_REG_MAX] = {
	[AW_PID_2032_ID_REG]			= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_SYSST_REG]		= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_SYSINT_REG]		= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_SYSINTM_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_SYSCTRL_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_SYSCTRL2_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_I2SCTRL_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_I2SCFG1_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_I2SCFG2_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_HAGCCFG1_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_HAGCCFG2_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_HAGCCFG3_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_HAGCCFG4_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_HAGCCFG5_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_HAGCCFG6_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_HAGCCFG7_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_HAGCST_REG]		= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_PRODID_REG]		= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_VBAT_REG]			= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_TEMP_REG]			= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_PVDD_REG]			= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_HAGCCFG8_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_DBGCTRL_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_I2SINT_REG]		= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_I2SCAPCNT_REG]	= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_ANASTA1_REG]		= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_ANASTA2_REG]		= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_ANASTA3_REG]		= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_ANASTA4_REG]		= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_DSMCFG1_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_DSMCFG2_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_DSMCFG3_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_DSMCFG4_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_DSMCFG5_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_DSMCFG6_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_DSMCFG7_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_DSMCFG8_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_TESTIN_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_TESTOUT_REG]		= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_VSNCTRL1_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_ISNCTRL1_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_ISNCTRL2_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_VTMCTRL1_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_VTMCTRL2_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_VTMCTRL3_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_ISNDAT_REG]		= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_VSNDAT_REG]		= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_PWMCTRL_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_PWMCTRL2_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_BSTCTRL1_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_BSTCTRL2_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_BSTCTRL3_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_BSTDBG1_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_BSTDBG2_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_BSTDBG3_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_PLLCTRL1_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_PLLCTRL2_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_PLLCTRL3_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_CDACTRL1_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_CDACTRL2_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_SADCCTRL_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_BSTCTRL8_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_TESTCTRL1_REG]	= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_TESTCTRL2_REG]	= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_EFCTRL1_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_EFCTRL2_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_EFWH_REG]			= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_EFWM2_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_EFWM1_REG]		= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_EFWL_REG]			= (AW_PID_2032_REG_RD_ACCESS | AW_PID_2032_REG_WR_ACCESS),
	[AW_PID_2032_EFRH_REG]			= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_EFRM2_REG]		= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_EFRM1_REG]		= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_EFRL_REG]			= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_TESTDET_REG]		= (AW_PID_2032_REG_RD_ACCESS),
	[AW_PID_2032_TM_REG]			= (AW_PID_2032_REG_NONE_ACCESS),
};

/* detail information of registers begin */
/* ID (0x00) detail */
/* IDCODE bit 15:0 (ID 0x00) */
#define AW_PID_2032_IDCODE_START_BIT	(0)
#define AW_PID_2032_IDCODE_BITS_LEN		(16)
#define AW_PID_2032_IDCODE_MASK			\
	(~(((1<<AW_PID_2032_IDCODE_BITS_LEN)-1) << AW_PID_2032_IDCODE_START_BIT))

#define AW_PID_2032_IDCODE_DEFAULT_VALUE	(0x2032)
#define AW_PID_2032_IDCODE_DEFAULT		\
	(AW_PID_2032_IDCODE_DEFAULT_VALUE << AW_PID_2032_IDCODE_START_BIT)

/* default value of ID (0x00) */
/* #define AW_PID_2032_ID_DEFAULT		(0x2032) */

/* SYSST (0x01) detail */
/* OVP2S bit 15 (SYSST 0x01) */
#define AW_PID_2032_OVP2S_START_BIT		(15)
#define AW_PID_2032_OVP2S_BITS_LEN		(1)
#define AW_PID_2032_OVP2S_MASK			\
	(~(((1<<AW_PID_2032_OVP2S_BITS_LEN)-1) << AW_PID_2032_OVP2S_START_BIT))

#define AW_PID_2032_OVP2S_NORMAL		(0)
#define AW_PID_2032_OVP2S_NORMAL_VALUE	\
	(AW_PID_2032_OVP2S_NORMAL << AW_PID_2032_OVP2S_START_BIT)

#define AW_PID_2032_OVP2S_OVP			(1)
#define AW_PID_2032_OVP2S_OVP_VALUE		\
	(AW_PID_2032_OVP2S_OVP << AW_PID_2032_OVP2S_START_BIT)

