LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263S/aw882xx_pid_2032_reg.h
#define AW_PID_2032_OVP2S_DEFAULT_VALUE	(0)
#define AW_PID_2032_OVP2S_DEFAULT		\
	(AW_PID_2032_OVP2S_DEFAULT_VALUE << AW_PID_2032_OVP2S_START_BIT)

/* UVLS bit 14 (SYSST 0x01) */
#define AW_PID_2032_UVLS_START_BIT		(14)
#define AW_PID_2032_UVLS_BITS_LEN		(1)
#define AW_PID_2032_UVLS_MASK			\
	(~(((1<<AW_PID_2032_UVLS_BITS_LEN)-1) << AW_PID_2032_UVLS_START_BIT))

#define AW_PID_2032_UVLS_VDD_ABOVE_2P8V	(0)
#define AW_PID_2032_UVLS_VDD_ABOVE_2P8V_VALUE	\
	(AW_PID_2032_UVLS_VDD_ABOVE_2P8V << AW_PID_2032_UVLS_START_BIT)

#define AW_PID_2032_UVLS_VDD_BELOW_2P8V	(1)
#define AW_PID_2032_UVLS_VDD_BELOW_2P8V_VALUE	\
	(AW_PID_2032_UVLS_VDD_BELOW_2P8V << AW_PID_2032_UVLS_START_BIT)

#define AW_PID_2032_UVLS_DEFAULT_VALUE	(0)
#define AW_PID_2032_UVLS_DEFAULT		\
	(AW_PID_2032_UVLS_DEFAULT_VALUE << AW_PID_2032_UVLS_START_BIT)

/* ADPS bit 13 (SYSST 0x01) */
#define AW_PID_2032_ADPS_START_BIT		(13)
#define AW_PID_2032_ADPS_BITS_LEN		(1)
#define AW_PID_2032_ADPS_MASK			\
	(~(((1<<AW_PID_2032_ADPS_BITS_LEN)-1) << AW_PID_2032_ADPS_START_BIT))

#define AW_PID_2032_ADPS_TRANSPARENT	(0)
#define AW_PID_2032_ADPS_TRANSPARENT_VALUE	\
	(AW_PID_2032_ADPS_TRANSPARENT << AW_PID_2032_ADPS_START_BIT)

#define AW_PID_2032_ADPS_BOOST			(1)
#define AW_PID_2032_ADPS_BOOST_VALUE	\
	(AW_PID_2032_ADPS_BOOST << AW_PID_2032_ADPS_START_BIT)

#define AW_PID_2032_ADPS_DEFAULT_VALUE	(0)
#define AW_PID_2032_ADPS_DEFAULT		\
	(AW_PID_2032_ADPS_DEFAULT_VALUE << AW_PID_2032_ADPS_START_BIT)

/* BSTOCS bit 11 (SYSST 0x01) */
#define AW_PID_2032_BSTOCS_START_BIT	(11)
#define AW_PID_2032_BSTOCS_BITS_LEN		(1)
#define AW_PID_2032_BSTOCS_MASK			\
	(~(((1<<AW_PID_2032_BSTOCS_BITS_LEN)-1) << AW_PID_2032_BSTOCS_START_BIT))

#define AW_PID_2032_BSTOCS_NORMAL		(0)
#define AW_PID_2032_BSTOCS_NORMAL_VALUE	\
	(AW_PID_2032_BSTOCS_NORMAL << AW_PID_2032_BSTOCS_START_BIT)

#define AW_PID_2032_BSTOCS_OVER_CURRENT	(1)
#define AW_PID_2032_BSTOCS_OVER_CURRENT_VALUE	\
	(AW_PID_2032_BSTOCS_OVER_CURRENT << AW_PID_2032_BSTOCS_START_BIT)

#define AW_PID_2032_BSTOCS_DEFAULT_VALUE	(0)
#define AW_PID_2032_BSTOCS_DEFAULT		\
	(AW_PID_2032_BSTOCS_DEFAULT_VALUE << AW_PID_2032_BSTOCS_START_BIT)

/* OVPS bit 10 (SYSST 0x01) */
#define AW_PID_2032_OVPS_START_BIT		(10)
#define AW_PID_2032_OVPS_BITS_LEN		(1)
#define AW_PID_2032_OVPS_MASK			\
	(~(((1<<AW_PID_2032_OVPS_BITS_LEN)-1) << AW_PID_2032_OVPS_START_BIT))

#define AW_PID_2032_OVPS_NORMAL			(0)
#define AW_PID_2032_OVPS_NORMAL_VALUE	\
	(AW_PID_2032_OVPS_NORMAL << AW_PID_2032_OVPS_START_BIT)

#define AW_PID_2032_OVPS_OVP			(1)
#define AW_PID_2032_OVPS_OVP_VALUE		\
	(AW_PID_2032_OVPS_OVP << AW_PID_2032_OVPS_START_BIT)

#define AW_PID_2032_OVPS_DEFAULT_VALUE	(0)
#define AW_PID_2032_OVPS_DEFAULT		\
	(AW_PID_2032_OVPS_DEFAULT_VALUE << AW_PID_2032_OVPS_START_BIT)

/* BSTS bit 9 (SYSST 0x01) */
#define AW_PID_2032_BSTS_START_BIT		(9)
#define AW_PID_2032_BSTS_BITS_LEN		(1)
#define AW_PID_2032_BSTS_MASK			\
	(~(((1<<AW_PID_2032_BSTS_BITS_LEN)-1) << AW_PID_2032_BSTS_START_BIT))

#define AW_PID_2032_BSTS_NOT_FINISHED	(0)
#define AW_PID_2032_BSTS_NOT_FINISHED_VALUE	\
	(AW_PID_2032_BSTS_NOT_FINISHED << AW_PID_2032_BSTS_START_BIT)

#define AW_PID_2032_BSTS_FINISHED		(1)
#define AW_PID_2032_BSTS_FINISHED_VALUE	\
	(AW_PID_2032_BSTS_FINISHED << AW_PID_2032_BSTS_START_BIT)

#define AW_PID_2032_BSTS_DEFAULT_VALUE	(0)
#define AW_PID_2032_BSTS_DEFAULT		\
	(AW_PID_2032_BSTS_DEFAULT_VALUE << AW_PID_2032_BSTS_START_BIT)

/* SWS bit 8 (SYSST 0x01) */
#define AW_PID_2032_SWS_START_BIT		(8)
#define AW_PID_2032_SWS_BITS_LEN		(1)
#define AW_PID_2032_SWS_MASK			\
	(~(((1<<AW_PID_2032_SWS_BITS_LEN)-1) << AW_PID_2032_SWS_START_BIT))

#define AW_PID_2032_SWS_NOT_SWITCHING	(0)
#define AW_PID_2032_SWS_NOT_SWITCHING_VALUE	\
	(AW_PID_2032_SWS_NOT_SWITCHING << AW_PID_2032_SWS_START_BIT)

#define AW_PID_2032_SWS_SWITCHING		(1)
#define AW_PID_2032_SWS_SWITCHING_VALUE	\
	(AW_PID_2032_SWS_SWITCHING << AW_PID_2032_SWS_START_BIT)

#define AW_PID_2032_SWS_DEFAULT_VALUE	(0)
#define AW_PID_2032_SWS_DEFAULT			\
	(AW_PID_2032_SWS_DEFAULT_VALUE << AW_PID_2032_SWS_START_BIT)

/* CLIPS bit 7 (SYSST 0x01) */
#define AW_PID_2032_CLIPS_START_BIT		(7)
#define AW_PID_2032_CLIPS_BITS_LEN		(1)
#define AW_PID_2032_CLIPS_MASK			\
	(~(((1<<AW_PID_2032_CLIPS_BITS_LEN)-1) << AW_PID_2032_CLIPS_START_BIT))

#define AW_PID_2032_CLIPS_NOT_CLIPPING	(0)
#define AW_PID_2032_CLIPS_NOT_CLIPPING_VALUE	\
	(AW_PID_2032_CLIPS_NOT_CLIPPING << AW_PID_2032_CLIPS_START_BIT)

#define AW_PID_2032_CLIPS_CLIPPING		(1)
#define AW_PID_2032_CLIPS_CLIPPING_VALUE	\
	(AW_PID_2032_CLIPS_CLIPPING << AW_PID_2032_CLIPS_START_BIT)

#define AW_PID_2032_CLIPS_DEFAULT_VALUE	(0)
#define AW_PID_2032_CLIPS_DEFAULT		\
	(AW_PID_2032_CLIPS_DEFAULT_VALUE << AW_PID_2032_CLIPS_START_BIT)

/* NOCLKS bit 5 (SYSST 0x01) */
#define AW_PID_2032_NOCLKS_START_BIT	(5)
#define AW_PID_2032_NOCLKS_BITS_LEN		(1)
#define AW_PID_2032_NOCLKS_MASK			\
	(~(((1<<AW_PID_2032_NOCLKS_BITS_LEN)-1) << AW_PID_2032_NOCLKS_START_BIT))

#define AW_PID_2032_NOCLKS_CLOCK_OK		(0)
#define AW_PID_2032_NOCLKS_CLOCK_OK_VALUE	\
	(AW_PID_2032_NOCLKS_CLOCK_OK << AW_PID_2032_NOCLKS_START_BIT)

#define AW_PID_2032_NOCLKS_NO_CLOCK		(1)
#define AW_PID_2032_NOCLKS_NO_CLOCK_VALUE	\
	(AW_PID_2032_NOCLKS_NO_CLOCK << AW_PID_2032_NOCLKS_START_BIT)

#define AW_PID_2032_NOCLKS_DEFAULT_VALUE	(0)
#define AW_PID_2032_NOCLKS_DEFAULT		\
	(AW_PID_2032_NOCLKS_DEFAULT_VALUE << AW_PID_2032_NOCLKS_START_BIT)

/* CLKS bit 4 (SYSST 0x01) */
#define AW_PID_2032_CLKS_START_BIT		(4)
#define AW_PID_2032_CLKS_BITS_LEN		(1)
#define AW_PID_2032_CLKS_MASK			\
	(~(((1<<AW_PID_2032_CLKS_BITS_LEN)-1) << AW_PID_2032_CLKS_START_BIT))

#define AW_PID_2032_CLKS_NOT_STABLE		(0)
#define AW_PID_2032_CLKS_NOT_STABLE_VALUE	\
	(AW_PID_2032_CLKS_NOT_STABLE << AW_PID_2032_CLKS_START_BIT)

#define AW_PID_2032_CLKS_STABLE			(1)
#define AW_PID_2032_CLKS_STABLE_VALUE	\
	(AW_PID_2032_CLKS_STABLE << AW_PID_2032_CLKS_START_BIT)

#define AW_PID_2032_CLKS_DEFAULT_VALUE	(0)
#define AW_PID_2032_CLKS_DEFAULT		\
	(AW_PID_2032_CLKS_DEFAULT_VALUE << AW_PID_2032_CLKS_START_BIT)

/* OCDS bit 3 (SYSST 0x01) */
#define AW_PID_2032_OCDS_START_BIT		(3)
#define AW_PID_2032_OCDS_BITS_LEN		(1)
#define AW_PID_2032_OCDS_MASK			\
	(~(((1<<AW_PID_2032_OCDS_BITS_LEN)-1) << AW_PID_2032_OCDS_START_BIT))

#define AW_PID_2032_OCDS_NORAML			(0)
#define AW_PID_2032_OCDS_NORAML_VALUE	\
	(AW_PID_2032_OCDS_NORAML << AW_PID_2032_OCDS_START_BIT)

#define AW_PID_2032_OCDS_OC				(1)
#define AW_PID_2032_OCDS_OC_VALUE		\
	(AW_PID_2032_OCDS_OC << AW_PID_2032_OCDS_START_BIT)

