LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263S/aw882xx_pid_2032_reg.h
/* NOCLKI bit 5 (SYSINT 0x02) */
#define AW_PID_2032_NOCLKI_START_BIT	(5)
#define AW_PID_2032_NOCLKI_BITS_LEN		(1)
#define AW_PID_2032_NOCLKI_MASK			\
	(~(((1<<AW_PID_2032_NOCLKI_BITS_LEN)-1) << AW_PID_2032_NOCLKI_START_BIT))

#define AW_PID_2032_NOCLKI_DEFAULT_VALUE	(0)
#define AW_PID_2032_NOCLKI_DEFAULT		\
	(AW_PID_2032_NOCLKI_DEFAULT_VALUE << AW_PID_2032_NOCLKI_START_BIT)

/* CLKI bit 4 (SYSINT 0x02) */
#define AW_PID_2032_CLKI_START_BIT		(4)
#define AW_PID_2032_CLKI_BITS_LEN		(1)
#define AW_PID_2032_CLKI_MASK			\
	(~(((1<<AW_PID_2032_CLKI_BITS_LEN)-1) << AW_PID_2032_CLKI_START_BIT))

#define AW_PID_2032_CLKI_DEFAULT_VALUE	(0)
#define AW_PID_2032_CLKI_DEFAULT		\
	(AW_PID_2032_CLKI_DEFAULT_VALUE << AW_PID_2032_CLKI_START_BIT)

/* OCDI bit 3 (SYSINT 0x02) */
#define AW_PID_2032_OCDI_START_BIT		(3)
#define AW_PID_2032_OCDI_BITS_LEN		(1)
#define AW_PID_2032_OCDI_MASK			\
	(~(((1<<AW_PID_2032_OCDI_BITS_LEN)-1) << AW_PID_2032_OCDI_START_BIT))

#define AW_PID_2032_OCDI_DEFAULT_VALUE	(0)
#define AW_PID_2032_OCDI_DEFAULT		\
	(AW_PID_2032_OCDI_DEFAULT_VALUE << AW_PID_2032_OCDI_START_BIT)

/* CLIP_PREI bit 2 (SYSINT 0x02) */
#define AW_PID_2032_CLIP_PREI_START_BIT	(2)
#define AW_PID_2032_CLIP_PREI_BITS_LEN	(1)
#define AW_PID_2032_CLIP_PREI_MASK		\
	(~(((1<<AW_PID_2032_CLIP_PREI_BITS_LEN)-1) << AW_PID_2032_CLIP_PREI_START_BIT))

#define AW_PID_2032_CLIP_PREI_DEFAULT_VALUE	(0)
#define AW_PID_2032_CLIP_PREI_DEFAULT	\
	(AW_PID_2032_CLIP_PREI_DEFAULT_VALUE << AW_PID_2032_CLIP_PREI_START_BIT)

/* OTHI bit 1 (SYSINT 0x02) */
#define AW_PID_2032_OTHI_START_BIT		(1)
#define AW_PID_2032_OTHI_BITS_LEN		(1)
#define AW_PID_2032_OTHI_MASK			\
	(~(((1<<AW_PID_2032_OTHI_BITS_LEN)-1) << AW_PID_2032_OTHI_START_BIT))

#define AW_PID_2032_OTHI_DEFAULT_VALUE	(0)
#define AW_PID_2032_OTHI_DEFAULT		\
	(AW_PID_2032_OTHI_DEFAULT_VALUE << AW_PID_2032_OTHI_START_BIT)

/* PLLI bit 0 (SYSINT 0x02) */
#define AW_PID_2032_PLLI_START_BIT		(0)
#define AW_PID_2032_PLLI_BITS_LEN		(1)
#define AW_PID_2032_PLLI_MASK			\
	(~(((1<<AW_PID_2032_PLLI_BITS_LEN)-1) << AW_PID_2032_PLLI_START_BIT))

#define AW_PID_2032_PLLI_DEFAULT_VALUE	(0)
#define AW_PID_2032_PLLI_DEFAULT		\
	(AW_PID_2032_PLLI_DEFAULT_VALUE << AW_PID_2032_PLLI_START_BIT)

/* default value of SYSINT (0x02) */
/* #define AW_PID_2032_SYSINT_DEFAULT		(0x0000) */

/* SYSINTM (0x03) detail */
/* OVP2M bit 15 (SYSINTM 0x03) */
#define AW_PID_2032_OVP2M_START_BIT		(15)
#define AW_PID_2032_OVP2M_BITS_LEN		(1)
#define AW_PID_2032_OVP2M_MASK			\
	(~(((1<<AW_PID_2032_OVP2M_BITS_LEN)-1) << AW_PID_2032_OVP2M_START_BIT))

#define AW_PID_2032_OVP2M_DEFAULT_VALUE	(1)
#define AW_PID_2032_OVP2M_DEFAULT		\
	(AW_PID_2032_OVP2M_DEFAULT_VALUE << AW_PID_2032_OVP2M_START_BIT)

/* UVLM bit 14 (SYSINTM 0x03) */
#define AW_PID_2032_UVLM_START_BIT		(14)
#define AW_PID_2032_UVLM_BITS_LEN		(1)
#define AW_PID_2032_UVLM_MASK			\
	(~(((1<<AW_PID_2032_UVLM_BITS_LEN)-1) << AW_PID_2032_UVLM_START_BIT))

#define AW_PID_2032_UVLM_DEFAULT_VALUE	(1)
#define AW_PID_2032_UVLM_DEFAULT		\
	(AW_PID_2032_UVLM_DEFAULT_VALUE << AW_PID_2032_UVLM_START_BIT)

/* ADPM bit 13 (SYSINTM 0x03) */
#define AW_PID_2032_ADPM_START_BIT		(13)
#define AW_PID_2032_ADPM_BITS_LEN		(1)
#define AW_PID_2032_ADPM_MASK			\
	(~(((1<<AW_PID_2032_ADPM_BITS_LEN)-1) << AW_PID_2032_ADPM_START_BIT))

#define AW_PID_2032_ADPM_DEFAULT_VALUE	(1)
#define AW_PID_2032_ADPM_DEFAULT		\
	(AW_PID_2032_ADPM_DEFAULT_VALUE << AW_PID_2032_ADPM_START_BIT)

/* BSTOCM bit 11 (SYSINTM 0x03) */
#define AW_PID_2032_BSTOCM_START_BIT	(11)
#define AW_PID_2032_BSTOCM_BITS_LEN		(1)
#define AW_PID_2032_BSTOCM_MASK			\
	(~(((1<<AW_PID_2032_BSTOCM_BITS_LEN)-1) << AW_PID_2032_BSTOCM_START_BIT))

#define AW_PID_2032_BSTOCM_DEFAULT_VALUE	(1)
#define AW_PID_2032_BSTOCM_DEFAULT		\
	(AW_PID_2032_BSTOCM_DEFAULT_VALUE << AW_PID_2032_BSTOCM_START_BIT)

/* OVPM bit 10 (SYSINTM 0x03) */
#define AW_PID_2032_OVPM_START_BIT		(10)
#define AW_PID_2032_OVPM_BITS_LEN		(1)
#define AW_PID_2032_OVPM_MASK			\
	(~(((1<<AW_PID_2032_OVPM_BITS_LEN)-1) << AW_PID_2032_OVPM_START_BIT))

#define AW_PID_2032_OVPM_DEFAULT_VALUE	(1)
#define AW_PID_2032_OVPM_DEFAULT		\
	(AW_PID_2032_OVPM_DEFAULT_VALUE << AW_PID_2032_OVPM_START_BIT)

/* BSTM bit 9 (SYSINTM 0x03) */
#define AW_PID_2032_BSTM_START_BIT		(9)
#define AW_PID_2032_BSTM_BITS_LEN		(1)
#define AW_PID_2032_BSTM_MASK			\
	(~(((1<<AW_PID_2032_BSTM_BITS_LEN)-1) << AW_PID_2032_BSTM_START_BIT))

#define AW_PID_2032_BSTM_DEFAULT_VALUE	(1)
#define AW_PID_2032_BSTM_DEFAULT		\
	(AW_PID_2032_BSTM_DEFAULT_VALUE << AW_PID_2032_BSTM_START_BIT)

/* SWM bit 8 (SYSINTM 0x03) */
#define AW_PID_2032_SWM_START_BIT		(8)
#define AW_PID_2032_SWM_BITS_LEN		(1)
#define AW_PID_2032_SWM_MASK			\
	(~(((1<<AW_PID_2032_SWM_BITS_LEN)-1) << AW_PID_2032_SWM_START_BIT))

#define AW_PID_2032_SWM_DEFAULT_VALUE	(1)
#define AW_PID_2032_SWM_DEFAULT			\
	(AW_PID_2032_SWM_DEFAULT_VALUE << AW_PID_2032_SWM_START_BIT)

/* CLIPM bit 7 (SYSINTM 0x03) */
#define AW_PID_2032_CLIPM_START_BIT		(7)
#define AW_PID_2032_CLIPM_BITS_LEN		(1)
#define AW_PID_2032_CLIPM_MASK			\
	(~(((1<<AW_PID_2032_CLIPM_BITS_LEN)-1) << AW_PID_2032_CLIPM_START_BIT))

#define AW_PID_2032_CLIPM_DEFAULT_VALUE	(1)
#define AW_PID_2032_CLIPM_DEFAULT		\
	(AW_PID_2032_CLIPM_DEFAULT_VALUE << AW_PID_2032_CLIPM_START_BIT)

/* NOCLKM bit 5 (SYSINTM 0x03) */
#define AW_PID_2032_NOCLKM_START_BIT	(5)
#define AW_PID_2032_NOCLKM_BITS_LEN		(1)
#define AW_PID_2032_NOCLKM_MASK			\
	(~(((1<<AW_PID_2032_NOCLKM_BITS_LEN)-1) << AW_PID_2032_NOCLKM_START_BIT))

#define AW_PID_2032_NOCLKM_DEFAULT_VALUE	(1)
#define AW_PID_2032_NOCLKM_DEFAULT		\
	(AW_PID_2032_NOCLKM_DEFAULT_VALUE << AW_PID_2032_NOCLKM_START_BIT)

/* CLKM bit 4 (SYSINTM 0x03) */
#define AW_PID_2032_CLKM_START_BIT		(4)
#define AW_PID_2032_CLKM_BITS_LEN		(1)
#define AW_PID_2032_CLKM_MASK			\
	(~(((1<<AW_PID_2032_CLKM_BITS_LEN)-1) << AW_PID_2032_CLKM_START_BIT))

#define AW_PID_2032_CLKM_DEFAULT_VALUE	(1)
#define AW_PID_2032_CLKM_DEFAULT		\
	(AW_PID_2032_CLKM_DEFAULT_VALUE << AW_PID_2032_CLKM_START_BIT)

