LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263S/aw882xx_pid_2032_reg.h
/* OCDM bit 3 (SYSINTM 0x03) */
#define AW_PID_2032_OCDM_START_BIT		(3)
#define AW_PID_2032_OCDM_BITS_LEN		(1)
#define AW_PID_2032_OCDM_MASK			\
	(~(((1<<AW_PID_2032_OCDM_BITS_LEN)-1) << AW_PID_2032_OCDM_START_BIT))

#define AW_PID_2032_OCDM_DEFAULT_VALUE	(1)
#define AW_PID_2032_OCDM_DEFAULT		\
	(AW_PID_2032_OCDM_DEFAULT_VALUE << AW_PID_2032_OCDM_START_BIT)

/* CLIP_PREM bit 2 (SYSINTM 0x03) */
#define AW_PID_2032_CLIP_PREM_START_BIT	(2)
#define AW_PID_2032_CLIP_PREM_BITS_LEN	(1)
#define AW_PID_2032_CLIP_PREM_MASK		\
	(~(((1<<AW_PID_2032_CLIP_PREM_BITS_LEN)-1) << AW_PID_2032_CLIP_PREM_START_BIT))

#define AW_PID_2032_CLIP_PREM_DEFAULT_VALUE	(1)
#define AW_PID_2032_CLIP_PREM_DEFAULT	\
	(AW_PID_2032_CLIP_PREM_DEFAULT_VALUE << AW_PID_2032_CLIP_PREM_START_BIT)

/* OTHM bit 1 (SYSINTM 0x03) */
#define AW_PID_2032_OTHM_START_BIT		(1)
#define AW_PID_2032_OTHM_BITS_LEN		(1)
#define AW_PID_2032_OTHM_MASK			\
	(~(((1<<AW_PID_2032_OTHM_BITS_LEN)-1) << AW_PID_2032_OTHM_START_BIT))

#define AW_PID_2032_OTHM_DEFAULT_VALUE	(1)
#define AW_PID_2032_OTHM_DEFAULT		\
	(AW_PID_2032_OTHM_DEFAULT_VALUE << AW_PID_2032_OTHM_START_BIT)

/* PLLM bit 0 (SYSINTM 0x03) */
#define AW_PID_2032_PLLM_START_BIT		(0)
#define AW_PID_2032_PLLM_BITS_LEN		(1)
#define AW_PID_2032_PLLM_MASK			\
	(~(((1<<AW_PID_2032_PLLM_BITS_LEN)-1) << AW_PID_2032_PLLM_START_BIT))

#define AW_PID_2032_PLLM_DEFAULT_VALUE	(1)
#define AW_PID_2032_PLLM_DEFAULT		\
	(AW_PID_2032_PLLM_DEFAULT_VALUE << AW_PID_2032_PLLM_START_BIT)

/* default value of SYSINTM (0x03) */
/* #define AW_PID_2032_SYSINTM_DEFAULT		(0xEFBF) */

/* SYSCTRL (0x04) detail */
/* ULS_MODE bit 15 (SYSCTRL 0x04) */
#define AW_PID_2032_ULS_MODE_START_BIT	(15)
#define AW_PID_2032_ULS_MODE_BITS_LEN	(1)
#define AW_PID_2032_ULS_MODE_MASK		\
	(~(((1<<AW_PID_2032_ULS_MODE_BITS_LEN)-1) << AW_PID_2032_ULS_MODE_START_BIT))

#define AW_PID_2032_ULS_MODE_LEGACY		(0)
#define AW_PID_2032_ULS_MODE_LEGACY_VALUE	\
	(AW_PID_2032_ULS_MODE_LEGACY << AW_PID_2032_ULS_MODE_START_BIT)

#define AW_PID_2032_ULS_MODE_TDM		(1)
#define AW_PID_2032_ULS_MODE_TDM_VALUE	\
	(AW_PID_2032_ULS_MODE_TDM << AW_PID_2032_ULS_MODE_START_BIT)

#define AW_PID_2032_ULS_MODE_DEFAULT_VALUE	(0)
#define AW_PID_2032_ULS_MODE_DEFAULT	\
	(AW_PID_2032_ULS_MODE_DEFAULT_VALUE << AW_PID_2032_ULS_MODE_START_BIT)

/* SPK_GAIN bit 14:12 (SYSCTRL 0x04) */
#define AW_PID_2032_SPK_GAIN_START_BIT	(12)
#define AW_PID_2032_SPK_GAIN_BITS_LEN	(3)
#define AW_PID_2032_SPK_GAIN_MASK		\
	(~(((1<<AW_PID_2032_SPK_GAIN_BITS_LEN)-1) << AW_PID_2032_SPK_GAIN_START_BIT))

#define AW_PID_2032_SPK_GAIN_7			(0)
#define AW_PID_2032_SPK_GAIN_7_VALUE	\
	(AW_PID_2032_SPK_GAIN_7 << AW_PID_2032_SPK_GAIN_START_BIT)

#define AW_PID_2032_SPK_GAIN_8			(1)
#define AW_PID_2032_SPK_GAIN_8_VALUE	\
	(AW_PID_2032_SPK_GAIN_8 << AW_PID_2032_SPK_GAIN_START_BIT)

#define AW_PID_2032_SPK_GAIN_10			(2)
#define AW_PID_2032_SPK_GAIN_10_VALUE	\
	(AW_PID_2032_SPK_GAIN_10 << AW_PID_2032_SPK_GAIN_START_BIT)

#define AW_PID_2032_SPK_GAIN_14			(3)
#define AW_PID_2032_SPK_GAIN_14_VALUE	\
	(AW_PID_2032_SPK_GAIN_14 << AW_PID_2032_SPK_GAIN_START_BIT)

#define AW_PID_2032_SPK_GAIN_16			(4)
#define AW_PID_2032_SPK_GAIN_16_VALUE	\
	(AW_PID_2032_SPK_GAIN_16 << AW_PID_2032_SPK_GAIN_START_BIT)

#define AW_PID_2032_SPK_GAIN_20			(5)
#define AW_PID_2032_SPK_GAIN_20_VALUE	\
	(AW_PID_2032_SPK_GAIN_20 << AW_PID_2032_SPK_GAIN_START_BIT)

#define AW_PID_2032_SPK_GAIN_DEFAULT_VALUE	(0x4)
#define AW_PID_2032_SPK_GAIN_DEFAULT	\
	(AW_PID_2032_SPK_GAIN_DEFAULT_VALUE << AW_PID_2032_SPK_GAIN_START_BIT)

/* RCV_GAIN bit 11:10 (SYSCTRL 0x04) */
#define AW_PID_2032_RCV_GAIN_START_BIT	(10)
#define AW_PID_2032_RCV_GAIN_BITS_LEN	(2)
#define AW_PID_2032_RCV_GAIN_MASK		\
	(~(((1<<AW_PID_2032_RCV_GAIN_BITS_LEN)-1) << AW_PID_2032_RCV_GAIN_START_BIT))

#define AW_PID_2032_RCV_GAIN_4P5		(0)
#define AW_PID_2032_RCV_GAIN_4P5_VALUE	\
	(AW_PID_2032_RCV_GAIN_4P5 << AW_PID_2032_RCV_GAIN_START_BIT)

#define AW_PID_2032_RCV_GAIN_5P0		(1)
#define AW_PID_2032_RCV_GAIN_5P0_VALUE	\
	(AW_PID_2032_RCV_GAIN_5P0 << AW_PID_2032_RCV_GAIN_START_BIT)

#define AW_PID_2032_RCV_GAIN_5P5		(2)
#define AW_PID_2032_RCV_GAIN_5P5_VALUE	\
	(AW_PID_2032_RCV_GAIN_5P5 << AW_PID_2032_RCV_GAIN_START_BIT)

#define AW_PID_2032_RCV_GAIN_7P5		(3)
#define AW_PID_2032_RCV_GAIN_7P5_VALUE	\
	(AW_PID_2032_RCV_GAIN_7P5 << AW_PID_2032_RCV_GAIN_START_BIT)

#define AW_PID_2032_RCV_GAIN_DEFAULT_VALUE	(0)
#define AW_PID_2032_RCV_GAIN_DEFAULT	\
	(AW_PID_2032_RCV_GAIN_DEFAULT_VALUE << AW_PID_2032_RCV_GAIN_START_BIT)

/* INTMODE bit 9 (SYSCTRL 0x04) */
#define AW_PID_2032_INTMODE_START_BIT	(9)
#define AW_PID_2032_INTMODE_BITS_LEN	(1)
#define AW_PID_2032_INTMODE_MASK		\
	(~(((1<<AW_PID_2032_INTMODE_BITS_LEN)-1) << AW_PID_2032_INTMODE_START_BIT))

#define AW_PID_2032_INTMODE_OPENMINUS_DRAIN	(0)
#define AW_PID_2032_INTMODE_OPENMINUS_DRAIN_VALUE	\
	(AW_PID_2032_INTMODE_OPENMINUS_DRAIN << AW_PID_2032_INTMODE_START_BIT)

#define AW_PID_2032_INTMODE_PUSHPULL	(1)
#define AW_PID_2032_INTMODE_PUSHPULL_VALUE	\
	(AW_PID_2032_INTMODE_PUSHPULL << AW_PID_2032_INTMODE_START_BIT)

#define AW_PID_2032_INTMODE_DEFAULT_VALUE	(0)
#define AW_PID_2032_INTMODE_DEFAULT		\
	(AW_PID_2032_INTMODE_DEFAULT_VALUE << AW_PID_2032_INTMODE_START_BIT)

/* default value of SYSINTM (0x03) */
#define  AW_PID_2032_SYSINTM_DEFAULT		(0xEFBF)

/* INTN bit 8 (SYSCTRL 0x04) */
#define AW_PID_2032_INTN_START_BIT		(8)
#define AW_PID_2032_INTN_BITS_LEN		(1)
#define AW_PID_2032_INTN_MASK			\
	(~(((1<<AW_PID_2032_INTN_BITS_LEN)-1) << AW_PID_2032_INTN_START_BIT))

#define AW_PID_2032_INTN_SYSINT			(0)
#define AW_PID_2032_INTN_SYSINT_VALUE	\
	(AW_PID_2032_INTN_SYSINT << AW_PID_2032_INTN_START_BIT)

#define AW_PID_2032_INTN_SYSST			(1)
#define AW_PID_2032_INTN_SYSST_VALUE	\
	(AW_PID_2032_INTN_SYSST << AW_PID_2032_INTN_START_BIT)

#define AW_PID_2032_INTN_DEFAULT_VALUE	(0)
#define AW_PID_2032_INTN_DEFAULT		\
	(AW_PID_2032_INTN_DEFAULT_VALUE << AW_PID_2032_INTN_START_BIT)

