LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263S/aw882xx_pid_2032_reg.h
/* RCV_MODE bit 7 (SYSCTRL 0x04) */
#define AW_PID_2032_RCV_MODE_START_BIT	(7)
#define AW_PID_2032_RCV_MODE_BITS_LEN	(1)
#define AW_PID_2032_RCV_MODE_MASK		\
	(~(((1<<AW_PID_2032_RCV_MODE_BITS_LEN)-1) << AW_PID_2032_RCV_MODE_START_BIT))

#define AW_PID_2032_RCV_MODE_SPEAKER	(0)
#define AW_PID_2032_RCV_MODE_SPEAKER_VALUE	\
	(AW_PID_2032_RCV_MODE_SPEAKER << AW_PID_2032_RCV_MODE_START_BIT)

#define AW_PID_2032_RCV_MODE_RECEIVER	(1)
#define AW_PID_2032_RCV_MODE_RECEIVER_VALUE	\
	(AW_PID_2032_RCV_MODE_RECEIVER << AW_PID_2032_RCV_MODE_START_BIT)

#define AW_PID_2032_RCV_MODE_DEFAULT_VALUE	(0)
#define AW_PID_2032_RCV_MODE_DEFAULT	\
	(AW_PID_2032_RCV_MODE_DEFAULT_VALUE << AW_PID_2032_RCV_MODE_START_BIT)

/* I2SEN bit 6 (SYSCTRL 0x04) */
#define AW_PID_2032_I2SEN_START_BIT		(6)
#define AW_PID_2032_I2SEN_BITS_LEN		(1)
#define AW_PID_2032_I2SEN_MASK			\
	(~(((1<<AW_PID_2032_I2SEN_BITS_LEN)-1) << AW_PID_2032_I2SEN_START_BIT))

#define AW_PID_2032_I2SEN_DISABLE		(0)
#define AW_PID_2032_I2SEN_DISABLE_VALUE	\
	(AW_PID_2032_I2SEN_DISABLE << AW_PID_2032_I2SEN_START_BIT)

#define AW_PID_2032_I2SEN_ENABLE		(1)
#define AW_PID_2032_I2SEN_ENABLE_VALUE	\
	(AW_PID_2032_I2SEN_ENABLE << AW_PID_2032_I2SEN_START_BIT)

#define AW_PID_2032_I2SEN_DEFAULT_VALUE	(0)
#define AW_PID_2032_I2SEN_DEFAULT		\
	(AW_PID_2032_I2SEN_DEFAULT_VALUE << AW_PID_2032_I2SEN_START_BIT)

/* WSINV bit 5 (SYSCTRL 0x04) */
#define AW_PID_2032_WSINV_START_BIT		(5)
#define AW_PID_2032_WSINV_BITS_LEN		(1)
#define AW_PID_2032_WSINV_MASK			\
	(~(((1<<AW_PID_2032_WSINV_BITS_LEN)-1) << AW_PID_2032_WSINV_START_BIT))

#define AW_PID_2032_WSINV_NOT_SWITCH	(0)
#define AW_PID_2032_WSINV_NOT_SWITCH_VALUE	\
	(AW_PID_2032_WSINV_NOT_SWITCH << AW_PID_2032_WSINV_START_BIT)

#define AW_PID_2032_WSINV_SWITCH		(1)
#define AW_PID_2032_WSINV_SWITCH_VALUE	\
	(AW_PID_2032_WSINV_SWITCH << AW_PID_2032_WSINV_START_BIT)

#define AW_PID_2032_WSINV_DEFAULT_VALUE	(0)
#define AW_PID_2032_WSINV_DEFAULT		\
	(AW_PID_2032_WSINV_DEFAULT_VALUE << AW_PID_2032_WSINV_START_BIT)

/* BCKINV bit 4 (SYSCTRL 0x04) */
#define AW_PID_2032_BCKINV_START_BIT	(4)
#define AW_PID_2032_BCKINV_BITS_LEN		(1)
#define AW_PID_2032_BCKINV_MASK			\
	(~(((1<<AW_PID_2032_BCKINV_BITS_LEN)-1) << AW_PID_2032_BCKINV_START_BIT))

#define AW_PID_2032_BCKINV_NOT_INVERT	(0)
#define AW_PID_2032_BCKINV_NOT_INVERT_VALUE	\
	(AW_PID_2032_BCKINV_NOT_INVERT << AW_PID_2032_BCKINV_START_BIT)

#define AW_PID_2032_BCKINV_INVERTED		(1)
#define AW_PID_2032_BCKINV_INVERTED_VALUE	\
	(AW_PID_2032_BCKINV_INVERTED << AW_PID_2032_BCKINV_START_BIT)

#define AW_PID_2032_BCKINV_DEFAULT_VALUE	(0)
#define AW_PID_2032_BCKINV_DEFAULT		\
	(AW_PID_2032_BCKINV_DEFAULT_VALUE << AW_PID_2032_BCKINV_START_BIT)

/* IPLL bit 3 (SYSCTRL 0x04) */
#define AW_PID_2032_IPLL_START_BIT		(3)
#define AW_PID_2032_IPLL_BITS_LEN		(1)
#define AW_PID_2032_IPLL_MASK			\
	(~(((1<<AW_PID_2032_IPLL_BITS_LEN)-1) << AW_PID_2032_IPLL_START_BIT))

#define AW_PID_2032_IPLL_BCK			(0)
#define AW_PID_2032_IPLL_BCK_VALUE		\
	(AW_PID_2032_IPLL_BCK << AW_PID_2032_IPLL_START_BIT)

#define AW_PID_2032_IPLL_WCK			(1)
#define AW_PID_2032_IPLL_WCK_VALUE		\
	(AW_PID_2032_IPLL_WCK << AW_PID_2032_IPLL_START_BIT)

#define AW_PID_2032_IPLL_DEFAULT_VALUE	(0)
#define AW_PID_2032_IPLL_DEFAULT		\
	(AW_PID_2032_IPLL_DEFAULT_VALUE << AW_PID_2032_IPLL_START_BIT)

/* AMPPD bit 1 (SYSCTRL 0x04) */
#define AW_PID_2032_AMPPD_START_BIT		(1)
#define AW_PID_2032_AMPPD_BITS_LEN		(1)
#define AW_PID_2032_AMPPD_MASK			\
	(~(((1<<AW_PID_2032_AMPPD_BITS_LEN)-1) << AW_PID_2032_AMPPD_START_BIT))

#define AW_PID_2032_AMPPD_WORKING		(0)
#define AW_PID_2032_AMPPD_WORKING_VALUE	\
	(AW_PID_2032_AMPPD_WORKING << AW_PID_2032_AMPPD_START_BIT)

#define AW_PID_2032_AMPPD_POWER_DOWN	(1)
#define AW_PID_2032_AMPPD_POWER_DOWN_VALUE	\
	(AW_PID_2032_AMPPD_POWER_DOWN << AW_PID_2032_AMPPD_START_BIT)

#define AW_PID_2032_AMPPD_DEFAULT_VALUE	(1)
#define AW_PID_2032_AMPPD_DEFAULT		\
	(AW_PID_2032_AMPPD_DEFAULT_VALUE << AW_PID_2032_AMPPD_START_BIT)

/* PWDN bit 0 (SYSCTRL 0x04) */
#define AW_PID_2032_PWDN_START_BIT		(0)
#define AW_PID_2032_PWDN_BITS_LEN		(1)
#define AW_PID_2032_PWDN_MASK			\
	(~(((1<<AW_PID_2032_PWDN_BITS_LEN)-1) << AW_PID_2032_PWDN_START_BIT))

#define AW_PID_2032_PWDN_WORKING		(0)
#define AW_PID_2032_PWDN_WORKING_VALUE	\
	(AW_PID_2032_PWDN_WORKING << AW_PID_2032_PWDN_START_BIT)

#define AW_PID_2032_PWDN_POWER_DOWN		(1)
#define AW_PID_2032_PWDN_POWER_DOWN_VALUE	\
	(AW_PID_2032_PWDN_POWER_DOWN << AW_PID_2032_PWDN_START_BIT)

#define AW_PID_2032_PWDN_DEFAULT_VALUE	(1)
#define AW_PID_2032_PWDN_DEFAULT		\
	(AW_PID_2032_PWDN_DEFAULT_VALUE << AW_PID_2032_PWDN_START_BIT)

/* default value of SYSCTRL (0x04) */
/* #define AW_PID_2032_SYSCTRL_DEFAULT		(0x4003) */

/* SYSCTRL2 (0x05) detail */
/* VOL bit 15:6 (SYSCTRL2 0x05) */
#define AW_PID_2032_VOL_START_BIT		(6)
#define AW_PID_2032_VOL_BITS_LEN		(10)
#define AW_PID_2032_VOL_MASK			\
	(~(((1<<AW_PID_2032_VOL_BITS_LEN)-1) << AW_PID_2032_VOL_START_BIT))

#define AW_PID_2032_VOL_DEFAULT_VALUE	(0)
#define AW_PID_2032_VOL_DEFAULT			\
	(AW_PID_2032_VOL_DEFAULT_VALUE << AW_PID_2032_VOL_START_BIT)

/* HDCCE bit 5 (SYSCTRL2 0x05) */
#define AW_PID_2032_HDCCE_START_BIT		(5)
#define AW_PID_2032_HDCCE_BITS_LEN		(1)
#define AW_PID_2032_HDCCE_MASK			\
	(~(((1<<AW_PID_2032_HDCCE_BITS_LEN)-1) << AW_PID_2032_HDCCE_START_BIT))

#define AW_PID_2032_HDCCE_DISABLE		(0)
#define AW_PID_2032_HDCCE_DISABLE_VALUE	\
	(AW_PID_2032_HDCCE_DISABLE << AW_PID_2032_HDCCE_START_BIT)

#define AW_PID_2032_HDCCE_ENABLE		(1)
#define AW_PID_2032_HDCCE_ENABLE_VALUE	\
	(AW_PID_2032_HDCCE_ENABLE << AW_PID_2032_HDCCE_START_BIT)

#define AW_PID_2032_HDCCE_DEFAULT_VALUE	(1)
#define AW_PID_2032_HDCCE_DEFAULT		\
	(AW_PID_2032_HDCCE_DEFAULT_VALUE << AW_PID_2032_HDCCE_START_BIT)

/* HMUTE bit 4 (SYSCTRL2 0x05) */
#define AW_PID_2032_HMUTE_START_BIT		(4)
#define AW_PID_2032_HMUTE_BITS_LEN		(1)
#define AW_PID_2032_HMUTE_MASK			\
	(~(((1<<AW_PID_2032_HMUTE_BITS_LEN)-1) << AW_PID_2032_HMUTE_START_BIT))

#define AW_PID_2032_HMUTE_DISABLE		(0)
#define AW_PID_2032_HMUTE_DISABLE_VALUE	\
	(AW_PID_2032_HMUTE_DISABLE << AW_PID_2032_HMUTE_START_BIT)

#define AW_PID_2032_HMUTE_ENABLE		(1)
#define AW_PID_2032_HMUTE_ENABLE_VALUE	\
	(AW_PID_2032_HMUTE_ENABLE << AW_PID_2032_HMUTE_START_BIT)

#define AW_PID_2032_HMUTE_DEFAULT_VALUE	(1)
#define AW_PID_2032_HMUTE_DEFAULT		\
	(AW_PID_2032_HMUTE_DEFAULT_VALUE << AW_PID_2032_HMUTE_START_BIT)

/* BST_IPEAK bit 3:0 (SYSCTRL2 0x05) */
#define AW_PID_2032_BST_IPEAK_START_BIT	(0)
#define AW_PID_2032_BST_IPEAK_BITS_LEN	(4)
#define AW_PID_2032_BST_IPEAK_MASK		\
	(~(((1<<AW_PID_2032_BST_IPEAK_BITS_LEN)-1) << AW_PID_2032_BST_IPEAK_START_BIT))

#define AW_PID_2032_BST_IPEAK_1P50A		(0)
#define AW_PID_2032_BST_IPEAK_1P50A_VALUE	\
	(AW_PID_2032_BST_IPEAK_1P50A << AW_PID_2032_BST_IPEAK_START_BIT)

#define AW_PID_2032_BST_IPEAK_1P75A		(1)
#define AW_PID_2032_BST_IPEAK_1P75A_VALUE	\
	(AW_PID_2032_BST_IPEAK_1P75A << AW_PID_2032_BST_IPEAK_START_BIT)

