LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263S/aw882xx_pid_2032_reg.h
#define AW_PID_2032_ATTH_DEFAULT_VALUE	(0x0030)
#define AW_PID_2032_ATTH_DEFAULT		\
	(AW_PID_2032_ATTH_DEFAULT_VALUE << AW_PID_2032_ATTH_START_BIT)

/* default value of HAGCCFG2 (0x0A) */
/* #define AW_PID_2032_HAGCCFG2_DEFAULT		(0x0030) */

/* HAGCCFG3 (0x0B) detail */
/* RTTH bit 15:0 (HAGCCFG3 0x0B) */
#define AW_PID_2032_RTTH_START_BIT		(0)
#define AW_PID_2032_RTTH_BITS_LEN		(16)
#define AW_PID_2032_RTTH_MASK			\
	(~(((1<<AW_PID_2032_RTTH_BITS_LEN)-1) << AW_PID_2032_RTTH_START_BIT))

#define AW_PID_2032_RTTH_RESERVED		(0)
#define AW_PID_2032_RTTH_RESERVED_VALUE	\
	(AW_PID_2032_RTTH_RESERVED << AW_PID_2032_RTTH_START_BIT)

#define AW_PID_2032_RTTH_DEFAULT_VALUE	(0x01E0)
#define AW_PID_2032_RTTH_DEFAULT		\
	(AW_PID_2032_RTTH_DEFAULT_VALUE << AW_PID_2032_RTTH_START_BIT)

/* default value of HAGCCFG3 (0x0B) */
/* #define AW_PID_2032_HAGCCFG3_DEFAULT		(0x01E0) */

/* HAGCCFG4 (0x0C) detail */
/* HOLDTH bit 7:0 (HAGCCFG4 0x0C) */
#define AW_PID_2032_HOLDTH_START_BIT	(0)
#define AW_PID_2032_HOLDTH_BITS_LEN		(8)
#define AW_PID_2032_HOLDTH_MASK			\
	(~(((1<<AW_PID_2032_HOLDTH_BITS_LEN)-1) << AW_PID_2032_HOLDTH_START_BIT))

#define AW_PID_2032_HOLDTH_RESERVED		(0)
#define AW_PID_2032_HOLDTH_RESERVED_VALUE	\
	(AW_PID_2032_HOLDTH_RESERVED << AW_PID_2032_HOLDTH_START_BIT)

#define AW_PID_2032_HOLDTH_DEFAULT_VALUE	(0x64)
#define AW_PID_2032_HOLDTH_DEFAULT		\
	(AW_PID_2032_HOLDTH_DEFAULT_VALUE << AW_PID_2032_HOLDTH_START_BIT)

/* default value of HAGCCFG4 (0x0C) */
/* #define AW_PID_2032_HAGCCFG4_DEFAULT		(0x0064) */

/* HAGCST (0x10) detail */
/* SPK_GAIN_ST bit 10:8 (HAGCST 0x10) */
#define AW_PID_2032_SPK_GAIN_ST_START_BIT	(8)
#define AW_PID_2032_SPK_GAIN_ST_BITS_LEN	(3)
#define AW_PID_2032_SPK_GAIN_ST_MASK	\
	(~(((1<<AW_PID_2032_SPK_GAIN_ST_BITS_LEN)-1) << AW_PID_2032_SPK_GAIN_ST_START_BIT))

#define AW_PID_2032_SPK_GAIN_ST_7		(0)
#define AW_PID_2032_SPK_GAIN_ST_7_VALUE	\
	(AW_PID_2032_SPK_GAIN_ST_7 << AW_PID_2032_SPK_GAIN_ST_START_BIT)

#define AW_PID_2032_SPK_GAIN_ST_8		(1)
#define AW_PID_2032_SPK_GAIN_ST_8_VALUE	\
	(AW_PID_2032_SPK_GAIN_ST_8 << AW_PID_2032_SPK_GAIN_ST_START_BIT)

#define AW_PID_2032_SPK_GAIN_ST_10		(2)
#define AW_PID_2032_SPK_GAIN_ST_10_VALUE	\
	(AW_PID_2032_SPK_GAIN_ST_10 << AW_PID_2032_SPK_GAIN_ST_START_BIT)

#define AW_PID_2032_SPK_GAIN_ST_14		(3)
#define AW_PID_2032_SPK_GAIN_ST_14_VALUE	\
	(AW_PID_2032_SPK_GAIN_ST_14 << AW_PID_2032_SPK_GAIN_ST_START_BIT)

#define AW_PID_2032_SPK_GAIN_ST_16		(4)
#define AW_PID_2032_SPK_GAIN_ST_16_VALUE	\
	(AW_PID_2032_SPK_GAIN_ST_16 << AW_PID_2032_SPK_GAIN_ST_START_BIT)

#define AW_PID_2032_SPK_GAIN_ST_20		(5)
#define AW_PID_2032_SPK_GAIN_ST_20_VALUE	\
	(AW_PID_2032_SPK_GAIN_ST_20 << AW_PID_2032_SPK_GAIN_ST_START_BIT)

#define AW_PID_2032_SPK_GAIN_ST_DEFAULT_VALUE	(0x4)
#define AW_PID_2032_SPK_GAIN_ST_DEFAULT	\
	(AW_PID_2032_SPK_GAIN_ST_DEFAULT_VALUE << AW_PID_2032_SPK_GAIN_ST_START_BIT)

/* BSTVOUT_ST bit 5:0 (HAGCST 0x10) */
#define AW_PID_2032_BSTVOUT_ST_START_BIT	(0)
#define AW_PID_2032_BSTVOUT_ST_BITS_LEN	(6)
#define AW_PID_2032_BSTVOUT_ST_MASK		\
	(~(((1<<AW_PID_2032_BSTVOUT_ST_BITS_LEN)-1) << AW_PID_2032_BSTVOUT_ST_START_BIT))

#define AW_PID_2032_BSTVOUT_ST_5P0V		(15)
#define AW_PID_2032_BSTVOUT_ST_5P0V_VALUE	\
	(AW_PID_2032_BSTVOUT_ST_5P0V << AW_PID_2032_BSTVOUT_ST_START_BIT)

#define AW_PID_2032_BSTVOUT_ST_10P25V	(57)
#define AW_PID_2032_BSTVOUT_ST_10P25V_VALUE	\
	(AW_PID_2032_BSTVOUT_ST_10P25V << AW_PID_2032_BSTVOUT_ST_START_BIT)

#define AW_PID_2032_BSTVOUT_ST_DEFAULT_VALUE	(0)
#define AW_PID_2032_BSTVOUT_ST_DEFAULT	\
	(AW_PID_2032_BSTVOUT_ST_DEFAULT_VALUE << AW_PID_2032_BSTVOUT_ST_START_BIT)

/* default value of HAGCST (0x10) */
/* #define AW_PID_2032_HAGCST_DEFAULT		(0x0400) */

/* VBAT (0x12) detail */
/* VBAT_DET bit 9:0 (VBAT 0x12) */
#define AW_PID_2032_VBAT_DET_START_BIT	(0)
#define AW_PID_2032_VBAT_DET_BITS_LEN	(10)
#define AW_PID_2032_VBAT_DET_MASK		\
	(~(((1<<AW_PID_2032_VBAT_DET_BITS_LEN)-1) << AW_PID_2032_VBAT_DET_START_BIT))

#define AW_PID_2032_VBAT_DET_DEFAULT_VALUE	(0x263)
#define AW_PID_2032_VBAT_DET_DEFAULT	\
	(AW_PID_2032_VBAT_DET_DEFAULT_VALUE << AW_PID_2032_VBAT_DET_START_BIT)

/* default value of VBAT (0x12) */
/* #define AW_PID_2032_VBAT_DEFAULT		(0x0263) */

/* TEMP (0x13) detail */
/* TEMP_DET bit 9:0 (TEMP 0x13) */
#define AW_PID_2032_TEMP_DET_START_BIT	(0)
#define AW_PID_2032_TEMP_DET_BITS_LEN	(10)
#define AW_PID_2032_TEMP_DET_MASK		\
	(~(((1<<AW_PID_2032_TEMP_DET_BITS_LEN)-1) << AW_PID_2032_TEMP_DET_START_BIT))

#define AW_PID_2032_TEMP_DET_MINUS_40_DEGREE	(0x3D8)
#define AW_PID_2032_TEMP_DET_MINUS_40_DEGREE_VALUE	\
	(AW_PID_2032_TEMP_DET_MINUS_40_DEGREE << AW_PID_2032_TEMP_DET_START_BIT)

#define AW_PID_2032_TEMP_DET_0_DEGREE	(0x00)
#define AW_PID_2032_TEMP_DET_0_DEGREE_VALUE	\
	(AW_PID_2032_TEMP_DET_0_DEGREE << AW_PID_2032_TEMP_DET_START_BIT)

#define AW_PID_2032_TEMP_DET_1_DEGREE	(0x01)
#define AW_PID_2032_TEMP_DET_1_DEGREE_VALUE	\
	(AW_PID_2032_TEMP_DET_1_DEGREE << AW_PID_2032_TEMP_DET_START_BIT)

#define AW_PID_2032_TEMP_DET_25_DEGREE	(0x19)
#define AW_PID_2032_TEMP_DET_25_DEGREE_VALUE	\
	(AW_PID_2032_TEMP_DET_25_DEGREE << AW_PID_2032_TEMP_DET_START_BIT)

#define AW_PID_2032_TEMP_DET_55_DEGREE	(0x37)
#define AW_PID_2032_TEMP_DET_55_DEGREE_VALUE	\
	(AW_PID_2032_TEMP_DET_55_DEGREE << AW_PID_2032_TEMP_DET_START_BIT)

#define AW_PID_2032_TEMP_DET_DEFAULT_VALUE	(0x019)
#define AW_PID_2032_TEMP_DET_DEFAULT	\
	(AW_PID_2032_TEMP_DET_DEFAULT_VALUE << AW_PID_2032_TEMP_DET_START_BIT)

/* default value of TEMP (0x13) */
/* #define AW_PID_2032_TEMP_DEFAULT		(0x0019) */

/* PVDD (0x14) detail */
/* PVDD_DET bit 9:0 (PVDD 0x14) */
#define AW_PID_2032_PVDD_DET_START_BIT	(0)
#define AW_PID_2032_PVDD_DET_BITS_LEN	(10)
#define AW_PID_2032_PVDD_DET_MASK		\
	(~(((1<<AW_PID_2032_PVDD_DET_BITS_LEN)-1) << AW_PID_2032_PVDD_DET_START_BIT))

#define AW_PID_2032_PVDD_DET_DEFAULT_VALUE	(0x263)
#define AW_PID_2032_PVDD_DET_DEFAULT	\
	(AW_PID_2032_PVDD_DET_DEFAULT_VALUE << AW_PID_2032_PVDD_DET_START_BIT)

/* default value of PVDD (0x14) */
/* #define AW_PID_2032_PVDD_DEFAULT		(0x0263) */

/* BSTCTRL1 (0x60) detail */
/* BST_RTH bit 13:8 (BSTCTRL1 0x60) */
#define AW_PID_2032_BST_RTH_START_BIT	(8)
#define AW_PID_2032_BST_RTH_BITS_LEN	(6)
#define AW_PID_2032_BST_RTH_MASK		\
	(~(((1<<AW_PID_2032_BST_RTH_BITS_LEN)-1) << AW_PID_2032_BST_RTH_START_BIT))

