LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263S/aw882xx_pid_2032_reg.h
#define AW_PID_2032_BST_RTH_DEFAULT_VALUE	(4)
#define AW_PID_2032_BST_RTH_DEFAULT		\
	(AW_PID_2032_BST_RTH_DEFAULT_VALUE << AW_PID_2032_BST_RTH_START_BIT)

/* BST_ATH bit 5:0 (BSTCTRL1 0x60) */
#define AW_PID_2032_BST_ATH_START_BIT	(0)
#define AW_PID_2032_BST_ATH_BITS_LEN	(6)
#define AW_PID_2032_BST_ATH_MASK		\
	(~(((1<<AW_PID_2032_BST_ATH_BITS_LEN)-1) << AW_PID_2032_BST_ATH_START_BIT))

#define AW_PID_2032_BST_ATH_DEFAULT_VALUE	(2)
#define AW_PID_2032_BST_ATH_DEFAULT		\
	(AW_PID_2032_BST_ATH_DEFAULT_VALUE << AW_PID_2032_BST_ATH_START_BIT)

/* default value of BSTCTRL1 (0x60) */
/* #define AW_PID_2032_BSTCTRL1_DEFAULT		(0x0402) */

/* BSTCTRL2 (0x61) detail */
/* VOUT_CTMD bit 15 (BSTCTRL2 0x61) */
#define AW_PID_2032_VOUT_CTMD_START_BIT	(15)
#define AW_PID_2032_VOUT_CTMD_BITS_LEN	(1)
#define AW_PID_2032_VOUT_CTMD_MASK		\
	(~(((1<<AW_PID_2032_VOUT_CTMD_BITS_LEN)-1) << AW_PID_2032_VOUT_CTMD_START_BIT))

#define AW_PID_2032_VOUT_CTMD_VREF		(0)
#define AW_PID_2032_VOUT_CTMD_VREF_VALUE	\
	(AW_PID_2032_VOUT_CTMD_VREF << AW_PID_2032_VOUT_CTMD_START_BIT)

#define AW_PID_2032_VOUT_CTMD_VFB		(1)
#define AW_PID_2032_VOUT_CTMD_VFB_VALUE	\
	(AW_PID_2032_VOUT_CTMD_VFB << AW_PID_2032_VOUT_CTMD_START_BIT)

#define AW_PID_2032_VOUT_CTMD_DEFAULT_VALUE	(0)
#define AW_PID_2032_VOUT_CTMD_DEFAULT	\
	(AW_PID_2032_VOUT_CTMD_DEFAULT_VALUE << AW_PID_2032_VOUT_CTMD_START_BIT)

/* BST_MODE bit 14:13 (BSTCTRL2 0x61) */
#define AW_PID_2032_BST_MODE_START_BIT	(13)
#define AW_PID_2032_BST_MODE_BITS_LEN	(2)
#define AW_PID_2032_BST_MODE_MASK		\
	(~(((1<<AW_PID_2032_BST_MODE_BITS_LEN)-1) << AW_PID_2032_BST_MODE_START_BIT))

#define AW_PID_2032_BST_MODE_TRANSPARENT	(0)
#define AW_PID_2032_BST_MODE_TRANSPARENT_VALUE	\
	(AW_PID_2032_BST_MODE_TRANSPARENT << AW_PID_2032_BST_MODE_START_BIT)

#define AW_PID_2032_BST_MODE_FORCE_BOOST	(1)
#define AW_PID_2032_BST_MODE_FORCE_BOOST_VALUE	\
	(AW_PID_2032_BST_MODE_FORCE_BOOST << AW_PID_2032_BST_MODE_START_BIT)

#define AW_PID_2032_BST_MODE_SMART_BOOST1	(2)
#define AW_PID_2032_BST_MODE_SMART_BOOST1_VALUE	\
	(AW_PID_2032_BST_MODE_SMART_BOOST1 << AW_PID_2032_BST_MODE_START_BIT)

#define AW_PID_2032_BST_MODE_SMART_BOOST2	(3)
#define AW_PID_2032_BST_MODE_SMART_BOOST2_VALUE	\
	(AW_PID_2032_BST_MODE_SMART_BOOST2 << AW_PID_2032_BST_MODE_START_BIT)

#define AW_PID_2032_BST_MODE_DEFAULT_VALUE	(0x3)
#define AW_PID_2032_BST_MODE_DEFAULT	\
	(AW_PID_2032_BST_MODE_DEFAULT_VALUE << AW_PID_2032_BST_MODE_START_BIT)

/* BST_TDEG bit 11:8 (BSTCTRL2 0x61) */
#define AW_PID_2032_BST_TDEG_START_BIT	(8)
#define AW_PID_2032_BST_TDEG_BITS_LEN	(4)
#define AW_PID_2032_BST_TDEG_MASK		\
	(~(((1<<AW_PID_2032_BST_TDEG_BITS_LEN)-1) << AW_PID_2032_BST_TDEG_START_BIT))

#define AW_PID_2032_BST_TDEG_0P50_MS	(0)
#define AW_PID_2032_BST_TDEG_0P50_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_0P50_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_1P00_MS	(1)
#define AW_PID_2032_BST_TDEG_1P00_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_1P00_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_2P00_MS	(2)
#define AW_PID_2032_BST_TDEG_2P00_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_2P00_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_4P00_MS	(3)
#define AW_PID_2032_BST_TDEG_4P00_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_4P00_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_8P00_MS	(4)
#define AW_PID_2032_BST_TDEG_8P00_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_8P00_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_10P7_MS	(5)
#define AW_PID_2032_BST_TDEG_10P7_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_10P7_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_13P3_MS	(6)
#define AW_PID_2032_BST_TDEG_13P3_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_13P3_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_16P0_MS	(7)
#define AW_PID_2032_BST_TDEG_16P0_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_16P0_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_18P6_MS	(8)
#define AW_PID_2032_BST_TDEG_18P6_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_18P6_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_21P3_MS	(9)
#define AW_PID_2032_BST_TDEG_21P3_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_21P3_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_24P0_MS	(10)
#define AW_PID_2032_BST_TDEG_24P0_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_24P0_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_32P0_MS	(11)
#define AW_PID_2032_BST_TDEG_32P0_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_32P0_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_64P0_MS	(12)
#define AW_PID_2032_BST_TDEG_64P0_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_64P0_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_128_MS		(13)
#define AW_PID_2032_BST_TDEG_128_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_128_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_256_MS		(14)
#define AW_PID_2032_BST_TDEG_256_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_256_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_1200_MS	(15)
#define AW_PID_2032_BST_TDEG_1200_MS_VALUE	\
	(AW_PID_2032_BST_TDEG_1200_MS << AW_PID_2032_BST_TDEG_START_BIT)

#define AW_PID_2032_BST_TDEG_DEFAULT_VALUE	(11)
#define AW_PID_2032_BST_TDEG_DEFAULT	\
	(AW_PID_2032_BST_TDEG_DEFAULT_VALUE << AW_PID_2032_BST_TDEG_START_BIT)

/* VOUT_VFBSET bit 7:6 (BSTCTRL2 0x61) */
#define AW_PID_2032_VOUT_VFBSET_START_BIT	(6)
#define AW_PID_2032_VOUT_VFBSET_BITS_LEN	(2)
#define AW_PID_2032_VOUT_VFBSET_MASK	\
	(~(((1<<AW_PID_2032_VOUT_VFBSET_BITS_LEN)-1) << AW_PID_2032_VOUT_VFBSET_START_BIT))

#define AW_PID_2032_VOUT_VFBSET_8P5V	(0)
#define AW_PID_2032_VOUT_VFBSET_8P5V_VALUE	\
	(AW_PID_2032_VOUT_VFBSET_8P5V << AW_PID_2032_VOUT_VFBSET_START_BIT)

#define AW_PID_2032_VOUT_VFBSET_9P5V	(1)
#define AW_PID_2032_VOUT_VFBSET_9P5V_VALUE	\
	(AW_PID_2032_VOUT_VFBSET_9P5V << AW_PID_2032_VOUT_VFBSET_START_BIT)

