LQM2015/stm32/Drivers/aw882xx/product_init_files/AW88263S/aw882xx_pid_2032_reg.h
#define AW_PID_2032_VOUT_VFBSET_10P5V	(2)
#define AW_PID_2032_VOUT_VFBSET_10P5V_VALUE	\
	(AW_PID_2032_VOUT_VFBSET_10P5V << AW_PID_2032_VOUT_VFBSET_START_BIT)

#define AW_PID_2032_VOUT_VFBSET_DEFAULT_VALUE	(1)
#define AW_PID_2032_VOUT_VFBSET_DEFAULT	\
	(AW_PID_2032_VOUT_VFBSET_DEFAULT_VALUE << AW_PID_2032_VOUT_VFBSET_START_BIT)

/* VOUT_VREFSET bit 5:0 (BSTCTRL2 0x61) */
#define AW_PID_2032_VOUT_VREFSET_START_BIT	(0)
#define AW_PID_2032_VOUT_VREFSET_BITS_LEN	(6)
#define AW_PID_2032_VOUT_VREFSET_MASK	\
	(~(((1<<AW_PID_2032_VOUT_VREFSET_BITS_LEN)-1) << AW_PID_2032_VOUT_VREFSET_START_BIT))

#define AW_PID_2032_VOUT_VREFSET_5P0V	(15)
#define AW_PID_2032_VOUT_VREFSET_5P0V_VALUE	\
	(AW_PID_2032_VOUT_VREFSET_5P0V << AW_PID_2032_VOUT_VREFSET_START_BIT)

#define AW_PID_2032_VOUT_VREFSET_10P25V	(57)
#define AW_PID_2032_VOUT_VREFSET_10P25V_VALUE	\
	(AW_PID_2032_VOUT_VREFSET_10P25V << AW_PID_2032_VOUT_VREFSET_START_BIT)

#define AW_PID_2032_VOUT_VREFSET_DEFAULT_VALUE	(0x33)
#define AW_PID_2032_VOUT_VREFSET_DEFAULT	\
	(AW_PID_2032_VOUT_VREFSET_DEFAULT_VALUE << AW_PID_2032_VOUT_VREFSET_START_BIT)

/* EFRH (0x78) detail */
/* EF_VSN_GESLP bit 9:0 (EFRH 0x78) */
#define AW_PID_2032_EF_VSN_GESLP_START_BIT	(0)
#define AW_PID_2032_EF_VSN_GESLP_BITS_LEN	(10)
#define AW_PID_2032_EF_VSN_GESLP_MASK		\
	(~(((1<<AW_PID_2032_EF_VSN_GESLP_BITS_LEN)-1) << AW_PID_2032_EF_VSN_GESLP_START_BIT))

/* EF_ISN_GESLP bit 9:0 (EFRM1 0x7A) */
#define AW_PID_2032_EF_ISN_GESLP_START_BIT	(0)
#define AW_PID_2032_EF_ISN_GESLP_BITS_LEN	(10)
#define AW_PID_2032_EF_ISN_GESLP_MASK	\
	(~(((1<<AW_PID_2032_EF_ISN_GESLP_BITS_LEN)-1) << AW_PID_2032_EF_ISN_GESLP_START_BIT))

/* default value of BSTCTRL2 (0x61) */
/* #define AW_PID_2032_BSTCTRL2_DEFAULT		(0x6B73) */

/* CCO_MUX bit 14 (PLLCTRL1 0x66) */
#define AW_PID_2032_CCO_MUX_START_BIT	(14)
#define AW_PID_2032_CCO_MUX_BITS_LEN	(1)
#define AW_PID_2032_CCO_MUX_MASK		\
	(~(((1<<AW_PID_2032_CCO_MUX_BITS_LEN)-1) << AW_PID_2032_CCO_MUX_START_BIT))
#define AW_PID_2032_CCO_MUX_DIVIDED		(0)
#define AW_PID_2032_CCO_MUX_DIVIDED_VALUE	\
	(AW_PID_2032_CCO_MUX_DIVIDED << AW_PID_2032_CCO_MUX_START_BIT)
#define AW_PID_2032_CCO_MUX_BYPASS		(1)
#define AW_PID_2032_CCO_MUX_BYPASS_VALUE	\
	(AW_PID_2032_CCO_MUX_BYPASS << AW_PID_2032_CCO_MUX_START_BIT)


/* detail information of registers end */
/********************************************
 * Volume Coefficient
 *******************************************/
#define AW_PID_2032_VOL_STEP		(6 * 8)

/********************************************
 * Vcalb
 *******************************************/
#define AW_PID_2032_EF_VSN_GESLP_SIGN_MASK		(~0x0200)
#define AW_PID_2032_EF_VSN_GESLP_NEG		(~0xfc00)

#define AW_PID_2032_EF_ISN_GESLP_SIGN_MASK		(~0x0200)
#define AW_PID_2032_EF_ISN_GESLP_NEG		(~0xfc00)

#define AW_PID_2032_CABL_BASE_VALUE			(1000)
#define AW_PID_2032_ICABLK_FACTOR			(1)
#define AW_PID_2032_VCABLK_FACTOR			(1)

#define AW_PID_2032_VCAL_FACTOR			(1<<13)

#define AW_PID_2032_MONITOR_VBAT_RANGE		(6025)
#define AW_PID_2032_MONITOR_INT_10BIT		(1023)
#define AW_PID_2032_MONITOR_TEMP_SIGN_MASK		(~(1<<9))
#define AW_PID_2032_MONITOR_TEMP_NEG_MASK		(0XFC00)

/********************************************
 * Dither
 *******************************************/
#define AW_PID_2032_DITHER_START_BIT	(13)
#define AW_PID_2032_DITHER_BITS_LEN	(1)
#define AW_PID_2032_DITHER_MASK	\
	(~(((1<<AW_PID_2032_DITHER_BITS_LEN)-1) << AW_PID_2032_DITHER_START_BIT))

#define AW_PID_2032_DITHER_DISABLE	(0)
#define AW_PID_2032_DITHER_DISABLE_VALUE	\
	(AW_PID_2032_DITHER_DISABLE << AW_PID_2032_DITHER_START_BIT)

#define AW_PID_2032_DITHER_ENABLE	(1)
#define AW_PID_2032_DITHER_ENABLE_VALUE	\
	(AW_PID_2032_DITHER_ENABLE << AW_PID_2032_DITHER_START_BIT)

#endif  /* #ifndef  __AW_PID_2032_REG_H__ */
